cmsis-svd/cmsis-svd/data/Infineon/s6e2h4xf.svd
        <!-- REGISTER "WDOGINTCLR" -->
        <register>
          <name>WDOGINTCLR</name>
          <description>Software Watchdog Timer Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "WDOGRIS" -->
        <register>
          <name>WDOGRIS</name>
          <description>Software Watchdog Timer Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIS" -->
            <field>
              <name>RIS</name>
              <description>Software watchdog interrupt status bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDOGSPMC" -->
        <register>
          <name>WDOGSPMC</name>
          <description>Software Watchdog Timer Window Watchdog Mode Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TGR" -->
            <field>
              <name>TGR</name>
              <description>Software watchdog trigger type bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WDOGLOCK" -->
        <register>
          <name>WDOGLOCK</name>
          <description>Software Watchdog Timer Lock Register</description>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DT" -->
    <peripheral>
      <name>DT</name>
      <description>Dual Timer</description>
      <version>A</version>
      <groupName>DT</groupName>
      <baseAddress>0x40015000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1C</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DT" -->
      <interrupt>
        <name>DT</name>
        <value>47</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "TIMER1LOAD" -->
        <register>
          <name>TIMER1LOAD</name>
          <description>Load Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1VALUE" -->
        <register>
          <name>TIMER1VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER1CONTROL" -->
        <register>
          <name>TIMER1CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000EF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMEREN" -->
            <field>
              <name>TIMEREN</name>
              <description>Enable bit </description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIMERMODE" -->
            <field>
              <name>TIMERMODE</name>
              <description>Mode bit </description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTENABLE" -->
            <field>
              <name>INTENABLE</name>
              <description>Interrupt enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIMERPRE" -->
            <field>
              <name>TIMERPRE</name>
              <description>Prescale bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIMERSIZE" -->
            <field>
              <name>TIMERSIZE</name>
              <description>Counter size bit </description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ONESHOT" -->
            <field>
              <name>ONESHOT</name>
              <description>One-shot mode bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1INTCLR" -->
        <register>
          <name>TIMER1INTCLR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "TIMER1RIS" -->
        <register>
          <name>TIMER1RIS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1RIS" -->
            <field>
              <name>TIMER1RIS</name>
              <description>Interrupt Status Register bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1MIS" -->
        <register>
          <name>TIMER1MIS</name>
          <description>Masked Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIMER1MIS" -->
            <field>
              <name>TIMER1MIS</name>
              <description>Masked Interrupt Status bit </description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TIMER1BGLOAD" -->
        <register>
          <name>TIMER1BGLOAD</name>
          <description>Background Load Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "TIMER2LOAD" -->
        <register derivedFrom="TIMER1LOAD">
          <name>TIMER2LOAD</name>
          <description>Load Register</description>
          <addressOffset>0x20</addressOffset>
        </register>
        <!-- REGISTER "TIMER2VALUE" -->
        <register derivedFrom="TIMER1VALUE">
          <name>TIMER2VALUE</name>
          <description>Value Register</description>
          <addressOffset>0x24</addressOffset>
        </register>
        <!-- REGISTER "TIMER2CONTROL" -->
        <register derivedFrom="TIMER1CONTROL">
          <name>TIMER2CONTROL</name>
          <description>Control Register</description>
          <addressOffset>0x28</addressOffset>
        </register>
