cmsis-svd/cmsis-svd/data/Infineon/s6e2h4xf.svd
        <!-- REGISTER "IRQ095MON" -->
        <register>
          <name>IRQ095MON</name>
          <description>IRQ095 Batch Read Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EXTINT3" -->
            <field>
              <name>EXTINT3</name>
              <description>Interrupt request of the external pin interrupt ch.31</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT2" -->
            <field>
              <name>EXTINT2</name>
              <description>Interrupt request of the external pin interrupt ch.30</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT1" -->
            <field>
              <name>EXTINT1</name>
              <description>Interrupt request of the external pin interrupt ch.29</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EXTINT0" -->
            <field>
              <name>EXTINT0</name>
              <description>Interrupt request of the external pin interrupt ch.28</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ096MON" -->
        <register>
          <name>IRQ096MON</name>
          <description>IRQ096 Batch Read Register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPRCINT5" -->
            <field>
              <name>QPRCINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT4" -->
            <field>
              <name>QPRCINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT3" -->
            <field>
              <name>QPRCINT3</name>
              <description>Count inversion interrupt request of QPRC ch.2</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT2" -->
            <field>
              <name>QPRCINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT1" -->
            <field>
              <name>QPRCINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT0" -->
            <field>
              <name>QPRCINT0</name>
              <description>PC match interrupt request of QPRC ch.2</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ097MON" -->
        <register>
          <name>IRQ097MON</name>
          <description>IRQ097 Batch Read Register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPRCINT5" -->
            <field>
              <name>QPRCINT5</name>
              <description>PC match and RC match interrupt request of QPRC ch.3</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT4" -->
            <field>
              <name>QPRCINT4</name>
              <description>Out-of-range interrupt request of QPRC ch.3</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT3" -->
            <field>
              <name>QPRCINT3</name>
              <description>Count inversion interrupt request of QPRC ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT2" -->
            <field>
              <name>QPRCINT2</name>
              <description>Overflow / underflow / zero index interrupt request of QPRC ch.3</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT1" -->
            <field>
              <name>QPRCINT1</name>
              <description>PC and RC match interrupt request of QPRC ch.3</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPRCINT0" -->
            <field>
              <name>QPRCINT0</name>
              <description>PC match interrupt request of QPRC ch.3</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ098MON" -->
        <register>
          <name>IRQ098MON</name>
          <description>IRQ098 Batch Read Register</description>
          <addressOffset>0x38C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BTINT1" -->
            <field>
              <name>BTINT1</name>
              <description>Interrupt request of source 1 (IRQ1) of the base timer ch.8</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BTINT0" -->
            <field>
              <name>BTINT0</name>
              <description>Interrupt request of source 0 (IRQ0) of the base timer ch.8</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
