cmsis-svd/cmsis-svd/data/Infineon/s6e2h4xf.svd
        <!-- REGISTER "INTPND" -->
        <register>
          <name>INTPND</name>
          <description>CAN Interrupt Pending Registers</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTPND32" -->
            <field>
              <name>INTPND32</name>
              <description>Bit31 of INTPND</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND31" -->
            <field>
              <name>INTPND31</name>
              <description>Bit30 of INTPND</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND30" -->
            <field>
              <name>INTPND30</name>
              <description>Bit29 of INTPND</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND29" -->
            <field>
              <name>INTPND29</name>
              <description>Bit28 of INTPND</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND28" -->
            <field>
              <name>INTPND28</name>
              <description>Bit27 of INTPND</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND27" -->
            <field>
              <name>INTPND27</name>
              <description>Bit26 of INTPND</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND26" -->
            <field>
              <name>INTPND26</name>
              <description>Bit25 of INTPND</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND25" -->
            <field>
              <name>INTPND25</name>
              <description>Bit24 of INTPND</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND24" -->
            <field>
              <name>INTPND24</name>
              <description>Bit23 of INTPND</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND23" -->
            <field>
              <name>INTPND23</name>
              <description>Bit22 of INTPND</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND22" -->
            <field>
              <name>INTPND22</name>
              <description>Bit21 of INTPND</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND21" -->
            <field>
              <name>INTPND21</name>
              <description>Bit20 of INTPND</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND20" -->
            <field>
              <name>INTPND20</name>
              <description>Bit19 of INTPND</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND19" -->
            <field>
              <name>INTPND19</name>
              <description>Bit18 of INTPND</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND18" -->
            <field>
              <name>INTPND18</name>
              <description>Bit17 of INTPND</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND17" -->
            <field>
              <name>INTPND17</name>
              <description>Bit16 of INTPND</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND16" -->
            <field>
              <name>INTPND16</name>
              <description>Bit15 of INTPND</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND15" -->
            <field>
              <name>INTPND15</name>
              <description>Bit14 of INTPND</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND14" -->
            <field>
              <name>INTPND14</name>
              <description>Bit13 of INTPND</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND13" -->
            <field>
              <name>INTPND13</name>
              <description>Bit12 of INTPND</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND12" -->
            <field>
              <name>INTPND12</name>
              <description>Bit11 of INTPND</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND11" -->
            <field>
              <name>INTPND11</name>
              <description>Bit10 of INTPND</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND10" -->
            <field>
              <name>INTPND10</name>
              <description>Bit9 of INTPND</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND9" -->
            <field>
              <name>INTPND9</name>
              <description>Bit8 of INTPND</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND8" -->
            <field>
              <name>INTPND8</name>
              <description>Bit7 of INTPND</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND7" -->
            <field>
              <name>INTPND7</name>
              <description>Bit6 of INTPND</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND6" -->
            <field>
              <name>INTPND6</name>
              <description>Bit5 of INTPND</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND5" -->
            <field>
              <name>INTPND5</name>
              <description>Bit4 of INTPND</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND4" -->
            <field>
              <name>INTPND4</name>
              <description>Bit3 of INTPND</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND3" -->
            <field>
              <name>INTPND3</name>
              <description>Bit2 of INTPND</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND2" -->
            <field>
              <name>INTPND2</name>
              <description>Bit1 of INTPND</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INTPND1" -->
            <field>
              <name>INTPND1</name>
              <description>Bit0 of INTPND</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MSGVAL" -->
        <register>
          <name>MSGVAL</name>
          <description>CAN Message Valid Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSGVAL32" -->
            <field>
              <name>MSGVAL32</name>
              <description>Bit31 of MSGVAL</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL31" -->
            <field>
              <name>MSGVAL31</name>
              <description>Bit30 of MSGVAL</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL30" -->
            <field>
              <name>MSGVAL30</name>
              <description>Bit29 of MSGVAL</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL29" -->
            <field>
              <name>MSGVAL29</name>
              <description>Bit28 of MSGVAL</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL28" -->
            <field>
              <name>MSGVAL28</name>
              <description>Bit27 of MSGVAL</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL27" -->
            <field>
              <name>MSGVAL27</name>
              <description>Bit26 of MSGVAL</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL26" -->
            <field>
              <name>MSGVAL26</name>
              <description>Bit25 of MSGVAL</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL25" -->
            <field>
              <name>MSGVAL25</name>
              <description>Bit24 of MSGVAL</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL24" -->
            <field>
              <name>MSGVAL24</name>
              <description>Bit23 of MSGVAL</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL23" -->
            <field>
              <name>MSGVAL23</name>
              <description>Bit22 of MSGVAL</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL22" -->
            <field>
              <name>MSGVAL22</name>
              <description>Bit21 of MSGVAL</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL21" -->
            <field>
              <name>MSGVAL21</name>
              <description>Bit20 of MSGVAL</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL20" -->
            <field>
              <name>MSGVAL20</name>
              <description>Bit19 of MSGVAL</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL19" -->
            <field>
              <name>MSGVAL19</name>
              <description>Bit18 of MSGVAL</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL18" -->
            <field>
              <name>MSGVAL18</name>
              <description>Bit17 of MSGVAL</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL17" -->
            <field>
              <name>MSGVAL17</name>
              <description>Bit16 of MSGVAL</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL16" -->
            <field>
              <name>MSGVAL16</name>
              <description>Bit15 of MSGVAL</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL15" -->
            <field>
              <name>MSGVAL15</name>
              <description>Bit14 of MSGVAL</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL14" -->
            <field>
              <name>MSGVAL14</name>
              <description>Bit13 of MSGVAL</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL13" -->
            <field>
              <name>MSGVAL13</name>
              <description>Bit12 of MSGVAL</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL12" -->
            <field>
              <name>MSGVAL12</name>
              <description>Bit11 of MSGVAL</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL11" -->
            <field>
              <name>MSGVAL11</name>
              <description>Bit10 of MSGVAL</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL10" -->
            <field>
              <name>MSGVAL10</name>
              <description>Bit9 of MSGVAL</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL9" -->
            <field>
              <name>MSGVAL9</name>
              <description>Bit8 of MSGVAL</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL8" -->
            <field>
              <name>MSGVAL8</name>
              <description>Bit7 of MSGVAL</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL7" -->
            <field>
              <name>MSGVAL7</name>
              <description>Bit6 of MSGVAL</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL6" -->
            <field>
              <name>MSGVAL6</name>
              <description>Bit5 of MSGVAL</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL5" -->
            <field>
              <name>MSGVAL5</name>
              <description>Bit4 of MSGVAL</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL4" -->
            <field>
              <name>MSGVAL4</name>
              <description>Bit3 of MSGVAL</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL3" -->
            <field>
              <name>MSGVAL3</name>
              <description>Bit2 of MSGVAL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL2" -->
            <field>
              <name>MSGVAL2</name>
              <description>Bit1 of MSGVAL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSGVAL1" -->
            <field>
              <name>MSGVAL1</name>
              <description>Bit0 of MSGVAL</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
